---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingFrontDirn1
source: html/4201d995-835f-0afa-012f-03eb655646e8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingFrontDirn1 Property

"Exterior Major Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemSpacingFrontDirn1 { get; }
```